tests/yaml/converter/controllers.yml
---
execution:
- concurrency: 1
  hold-for: 60s
  iterations: 1
  ramp-up: 60s
  scenario: Thread Group
scenarios:
  Thread Group:
    requests:
    - if: condition1
      then:
      - label: BD
        method: GET
        url: http://blazedemo.com/
      - if: condition2
        then:
        - label: BD/reserve
          method: GET
          url: http://blazedemo.com/reserve.php
    - do:
      - label: HTTP Request
        method: GET
        url: http://example.com/
      loop: 42
    - foreach: input
      loop-variable: output
      range: 1 to 10
      requests:
      - label: demo/BM
        method: GET
        url: http://demo.blazemeter.com/
    - label: example.com/1
      method: GET
      url: http://example.com/1
    - label: example.com/2
      method: GET
      url: http://example.com/2
    - do:
      - label: HTTP Request
        method: GET
        url: http://google.com/
      while: condition
    store-cache: false
    store-cookie: false
    use-dns-cache-mgr: false