tests/yaml/converter/disabled.yml
---
execution:
- concurrency: 1
  hold-for: 60s
  iterations: 1
  ramp-up: 60s
  scenario: First Thread Group
- concurrency: 1
  hold-for: 60s
  iterations: 1
  ramp-up: 60s
  scenario: Second Thread Group
scenarios:
  First Thread Group:
    data-sources:
    - delimiter: ','
      path: not_found.csv
      quoted: false
      recycle: true
    headers:
      global_header: global_value
      tg1: v1
      tg2: v2
    requests:
    - assert:
      - contains:
        - '123'
        - '567'
        not: false
        regexp: true
        subject: body
      assert-jsonpath:
      - expect-null: false
        expected-value: '*'
        invert: false
        jsonpath: $.
        validate: true
      body: one-two
      label: First HTTP Request
      method: GET
      url: http://10.0.0.1/
    - assert:
      - contains:
        - test
        not: true
        regexp: true
        subject: headers
      body:
        param1: value1
        param2: value2
      extract-jsonpath:
        var_name:
          default: NOT_FOUND
          jsonpath: $.jsonpath[0]
      extract-regexp:
        reg_one:
          default: ''
          match-no: 0
          regexp: '*'
          template: '1'
      label: request with params
      method: GET
      url: http://8.8.8.8/
    - label: with headers
      method: GET
      url: http://127.0.0.1/
    - assert-jsonpath:
      - expect-null: false
        invert: false
        jsonpath: $.
        validate: false
      extract-regexp:
        reg_two:
          default: def
          match-no: 0
          regexp: '*'
          template: '1'
      headers:
        header1: value1
      label: HTTP Request
      method: GET
      think-time: 500ms
      timeout: 200ms
      url: http://192.168.0.1/
    store-cache: false
    store-cookie: false
    use-dns-cache-mgr: true
  Second Thread Group:
    data-sources:
    - delimiter: ','
      path: not_found.csv
      quoted: false
      recycle: true
    headers:
      global_header: global_value
    requests:
    - assert:
      - contains:
        - '123123'
        not: true
        regexp: true
        subject: body
      label: request
      method: GET
      url: http://192.168.0.2/
    store-cache: false
    store-cookie: false
    use-dns-cache-mgr: true